#Animal = ["企鹅","信天翁","鸵鸟","斑马","长颈鹿","虎","金钱豹"]
Animal = [24,25,26,27,28,29,30]

Feature = ["有毛发","有奶","有羽毛","会飞","会下蛋","吃肉",          #  0  1  2  3  4  5
           "有犬齿","有爪","眼盯前方","有蹄","反刍","黄褐色",        #  6  7  8  9 10 11
           "有暗斑点","有黑色条纹","长脖","长腿","不会飞","会游泳",  # 12 13 14 15 16 17
           "黑白两色","善飞","哺乳类","鸟类","肉食类","蹄类",        # 18 19 20 21 22 23
           "企鹅","信天翁","鸵鸟","斑马","长颈鹿","虎","金钱豹"]     # 24 25 26 27 28 29 30

# 确定性知识：(对象，属性，值) 或者 （关系，对象1，对象2）
# 非确定性知识：（对象，属性，值，可信度因子【0，1】）

#------------------------ 规则库 ------------------------

R1  = [[0,"then"],20]
R2  = [[1,"then"],20]
R3  = [[2,"then"],21]
R4  = [[3,4,"then"],21]
R5  = [[5,"then"],22]
R6  = [[6,7,8,"then"],22]
R7  = [[20,9,"then"],23]
R8  = [[20,10,"then"],23]
R9  = [[20,22,11,12,"then"],30]
R10 = [[20,22,11,13,"then"],29]
R11 = [[23,14,15,12,"then"],28]
R12 = [[23,13,"then"],27]
R13 = [[21,14,15,16,18,"then"],26]
R14 = [[21,17,18,16,"then"],24]
R15 = [[21,19,"then"],25]

Rules_set = [R1,R2,R3,R4,R5,R6,R7,R8,R9,R10,R11,R12,R13,R14,R15]

#------------------------ 综合数据库 ------------------------

# 初始综合数据库：
#ex1 = ["有暗斑点","长脖","长腿","有奶","有蹄"]
ex1 = [12,14,15,1,9]
ex2 = [14,15,10,1,12]
#------------------------ 控制系统 ------------------------

for rule in Rules_set:
    length_rule = len(rule[0]) - 1
    flag = 0
    for feature in range(length_rule):
        if rule[0][feature] in ex2:
            flag = flag + 1
        if flag == length_rule:
            ex2.append(rule[1])
            #print(ex1)
            if rule[1] in Animal:
                print(Feature[rule[1]])




